[
    {
      "lesson_no": 1,
      "title": "Basic Spanish Vocabulary for Everyday Use",
      "description": "Introduces fundamental Spanish words for daily interactions, including greetings, common objects, and essential actions for absolute beginners."
    },
    {
      "lesson_no": 2,
      "title": "Numbers, Time, and Days of the Week",
      "description": "Focuses on numbers, telling time, and days of the week, enabling learners to plan, schedule, and perform basic counting tasks."
    },
    {
      "lesson_no": 3,
      "title": "Family and Relationships",
      "description": "Covers vocabulary related to family members, relationships, and common phrases for discussing family dynamics and personal connections."
    },
    {
      "lesson_no": 4,
      "title": "Food, Drinks, and Dining",
      "description": "Explores Spanish words for food, drinks, and dining, helping learners communicate in restaurants, markets, or during meals."
    },
    {
      "lesson_no": 5,
      "title": "Travel and Directions",
      "description": "Introduces vocabulary for transportation, directions, and navigating places, making it easier to travel and ask for assistance in Spanish."
    },
    {
      "lesson_no": 6,
      "title": "Describing People and Things",
      "description": "Focuses on adjectives and descriptive phrases to talk about appearances, personalities, and characteristics of people and objects."
    },
    {
      "lesson_no": 7,
      "title": "Weather and Nature",
      "description": "Covers vocabulary related to weather conditions, seasons, and nature, enabling learners to discuss the environment and outdoor activities."
    },
    {
      "lesson_no": 8,
      "title": "Health and Wellness",
      "description": "Provides words and phrases for discussing health, illnesses, and medical treatment, useful for emergencies or routine doctor visits."
    },
    {
      "lesson_no": 9,
      "title": "Workplace and Professions",
      "description": "Focuses on terms related to jobs, office settings, and professional roles, equipping learners for conversations about work and employment."
    },
    {
      "lesson_no": 10,
      "title": "Travel and Tourism",
      "description": "Teaches vocabulary for travel, tourism, and exploring new places, helping learners navigate airports, hotels, and tourist attractions."
    }
  ]
  